espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** I3C_MST_DEVICE_CTRL_REG register
 *  DEVICE_CTRL register controls the transfer properties and disposition of
 *  controllers capabilities.
 */
#define I3C_MST_DEVICE_CTRL_REG (DR_REG_I3C_MST_BASE + 0x0)
/** I3C_MST_REG_BA_INCLUDE : R/W; bitpos: [1]; default: 0;
 *  This bit is used to include I3C broadcast address(0x7E) for private transfer.(If
 *  I3C broadcast address is not include for the private transfer, In-Band Interrupts
 *  driven from Slaves may not win address arbitration. Hence IBIs will get delayed)
 */
#define I3C_MST_REG_BA_INCLUDE    (BIT(1))
#define I3C_MST_REG_BA_INCLUDE_M  (I3C_MST_REG_BA_INCLUDE_V << I3C_MST_REG_BA_INCLUDE_S)
#define I3C_MST_REG_BA_INCLUDE_V  0x00000001U
#define I3C_MST_REG_BA_INCLUDE_S  1
/** I3C_MST_REG_TRANS_START : R/W; bitpos: [2]; default: 0;
 *  Transfer Start
 */
#define I3C_MST_REG_TRANS_START    (BIT(2))
#define I3C_MST_REG_TRANS_START_M  (I3C_MST_REG_TRANS_START_V << I3C_MST_REG_TRANS_START_S)
#define I3C_MST_REG_TRANS_START_V  0x00000001U
#define I3C_MST_REG_TRANS_START_S  2
/** I3C_MST_REG_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define I3C_MST_REG_CLK_EN    (BIT(3))
#define I3C_MST_REG_CLK_EN_M  (I3C_MST_REG_CLK_EN_V << I3C_MST_REG_CLK_EN_S)
#define I3C_MST_REG_CLK_EN_V  0x00000001U
#define I3C_MST_REG_CLK_EN_S  3
/** I3C_MST_REG_IBI_RSTART_TRANS_EN : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define I3C_MST_REG_IBI_RSTART_TRANS_EN    (BIT(4))
#define I3C_MST_REG_IBI_RSTART_TRANS_EN_M  (I3C_MST_REG_IBI_RSTART_TRANS_EN_V << I3C_MST_REG_IBI_RSTART_TRANS_EN_S)
#define I3C_MST_REG_IBI_RSTART_TRANS_EN_V  0x00000001U
#define I3C_MST_REG_IBI_RSTART_TRANS_EN_S  4
/** I3C_MST_REG_AUTO_DIS_IBI_EN : R/W; bitpos: [5]; default: 1;
 *  NA
 */
#define I3C_MST_REG_AUTO_DIS_IBI_EN    (BIT(5))
#define I3C_MST_REG_AUTO_DIS_IBI_EN_M  (I3C_MST_REG_AUTO_DIS_IBI_EN_V << I3C_MST_REG_AUTO_DIS_IBI_EN_S)
#define I3C_MST_REG_AUTO_DIS_IBI_EN_V  0x00000001U
#define I3C_MST_REG_AUTO_DIS_IBI_EN_S  5
/** I3C_MST_REG_DMA_RX_EN : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define I3C_MST_REG_DMA_RX_EN    (BIT(6))
#define I3C_MST_REG_DMA_RX_EN_M  (I3C_MST_REG_DMA_RX_EN_V << I3C_MST_REG_DMA_RX_EN_S)
#define I3C_MST_REG_DMA_RX_EN_V  0x00000001U
#define I3C_MST_REG_DMA_RX_EN_S  6
/** I3C_MST_REG_DMA_TX_EN : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define I3C_MST_REG_DMA_TX_EN    (BIT(7))
#define I3C_MST_REG_DMA_TX_EN_M  (I3C_MST_REG_DMA_TX_EN_V << I3C_MST_REG_DMA_TX_EN_S)
#define I3C_MST_REG_DMA_TX_EN_V  0x00000001U
#define I3C_MST_REG_DMA_TX_EN_S  7
/** I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN : R/W; bitpos: [8]; default: 0;
 *  0: rx high bit first, 1: rx low bit first
 */
#define I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN    (BIT(8))
#define I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN_M  (I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN_V << I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN_S)
#define I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN_V  0x00000001U
#define I3C_MST_REG_MULTI_SLV_SINGLE_CCC_EN_S  8
/** I3C_MST_REG_RX_BIT_ORDER : R/W; bitpos: [9]; default: 0;
 *  0: rx low byte fist, 1: rx high byte first
 */
#define I3C_MST_REG_RX_BIT_ORDER    (BIT(9))
#define I3C_MST_REG_RX_BIT_ORDER_M  (I3C_MST_REG_RX_BIT_ORDER_V << I3C_MST_REG_RX_BIT_ORDER_S)
#define I3C_MST_REG_RX_BIT_ORDER_V  0x00000001U
#define I3C_MST_REG_RX_BIT_ORDER_S  9
/** I3C_MST_REG_RX_BYTE_ORDER : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RX_BYTE_ORDER    (BIT(10))
#define I3C_MST_REG_RX_BYTE_ORDER_M  (I3C_MST_REG_RX_BYTE_ORDER_V << I3C_MST_REG_RX_BYTE_ORDER_S)
#define I3C_MST_REG_RX_BYTE_ORDER_V  0x00000001U
#define I3C_MST_REG_RX_BYTE_ORDER_S  10
/** I3C_MST_REG_SCL_PULLUP_FORCE_EN : R/W; bitpos: [11]; default: 0;
 *  This bit is used to force scl_pullup_en
 */
#define I3C_MST_REG_SCL_PULLUP_FORCE_EN    (BIT(11))
#define I3C_MST_REG_SCL_PULLUP_FORCE_EN_M  (I3C_MST_REG_SCL_PULLUP_FORCE_EN_V << I3C_MST_REG_SCL_PULLUP_FORCE_EN_S)
#define I3C_MST_REG_SCL_PULLUP_FORCE_EN_V  0x00000001U
#define I3C_MST_REG_SCL_PULLUP_FORCE_EN_S  11
/** I3C_MST_REG_SCL_OE_FORCE_EN : R/W; bitpos: [12]; default: 1;
 *  This bit is used to force scl_oe
 */
#define I3C_MST_REG_SCL_OE_FORCE_EN    (BIT(12))
#define I3C_MST_REG_SCL_OE_FORCE_EN_M  (I3C_MST_REG_SCL_OE_FORCE_EN_V << I3C_MST_REG_SCL_OE_FORCE_EN_S)
#define I3C_MST_REG_SCL_OE_FORCE_EN_V  0x00000001U
#define I3C_MST_REG_SCL_OE_FORCE_EN_S  12
/** I3C_MST_REG_SDA_PP_RD_PULLUP_EN : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define I3C_MST_REG_SDA_PP_RD_PULLUP_EN    (BIT(13))
#define I3C_MST_REG_SDA_PP_RD_PULLUP_EN_M  (I3C_MST_REG_SDA_PP_RD_PULLUP_EN_V << I3C_MST_REG_SDA_PP_RD_PULLUP_EN_S)
#define I3C_MST_REG_SDA_PP_RD_PULLUP_EN_V  0x00000001U
#define I3C_MST_REG_SDA_PP_RD_PULLUP_EN_S  13
/** I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN    (BIT(14))
#define I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN_M  (I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN_V << I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN_S)
#define I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN_V  0x00000001U
#define I3C_MST_REG_SDA_RD_TBIT_HLVL_PULLUP_EN_S  14
/** I3C_MST_REG_SDA_PP_WR_PULLUP_EN : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define I3C_MST_REG_SDA_PP_WR_PULLUP_EN    (BIT(15))
#define I3C_MST_REG_SDA_PP_WR_PULLUP_EN_M  (I3C_MST_REG_SDA_PP_WR_PULLUP_EN_V << I3C_MST_REG_SDA_PP_WR_PULLUP_EN_S)
#define I3C_MST_REG_SDA_PP_WR_PULLUP_EN_V  0x00000001U
#define I3C_MST_REG_SDA_PP_WR_PULLUP_EN_S  15
/** I3C_MST_REG_DATA_BYTE_CNT_UNLATCH : R/W; bitpos: [16]; default: 0;
 *  1: read current real-time updated value  0: read latch data byte cnt value
 */
#define I3C_MST_REG_DATA_BYTE_CNT_UNLATCH    (BIT(16))
#define I3C_MST_REG_DATA_BYTE_CNT_UNLATCH_M  (I3C_MST_REG_DATA_BYTE_CNT_UNLATCH_V << I3C_MST_REG_DATA_BYTE_CNT_UNLATCH_S)
#define I3C_MST_REG_DATA_BYTE_CNT_UNLATCH_V  0x00000001U
#define I3C_MST_REG_DATA_BYTE_CNT_UNLATCH_S  16
/** I3C_MST_REG_MEM_CLK_FORCE_ON : R/W; bitpos: [17]; default: 0;
 *  1: dev characteristic and address table memory clk  date force on . 0 :  clock
 *  gating by rd/wr.
 */
#define I3C_MST_REG_MEM_CLK_FORCE_ON    (BIT(17))
#define I3C_MST_REG_MEM_CLK_FORCE_ON_M  (I3C_MST_REG_MEM_CLK_FORCE_ON_V << I3C_MST_REG_MEM_CLK_FORCE_ON_S)
#define I3C_MST_REG_MEM_CLK_FORCE_ON_V  0x00000001U
#define I3C_MST_REG_MEM_CLK_FORCE_ON_S  17

/** I3C_MST_BUFFER_THLD_CTRL_REG register
 *  In-Band Interrupt Status Threshold Value . Every In Band Interrupt received by I3C
 *  controller generates an IBI status. This field controls the number of IBI status
 *  entries in the IBI buffer that trigger the IBI_STATUS_THLD_STAT interrupt.
 */
#define I3C_MST_BUFFER_THLD_CTRL_REG (DR_REG_I3C_MST_BASE + 0x1c)
/** I3C_MST_REG_CMD_BUF_EMPTY_THLD : R/W; bitpos: [3:0]; default: 1;
 *  Command Buffer Empty Threshold Value is used to control the number of empty
 *  locations(or greater) in the Command Buffer that trigger CMD_BUFFER_READY_STAT
 *  interrupt.
 */
#define I3C_MST_REG_CMD_BUF_EMPTY_THLD    0x0000000FU
#define I3C_MST_REG_CMD_BUF_EMPTY_THLD_M  (I3C_MST_REG_CMD_BUF_EMPTY_THLD_V << I3C_MST_REG_CMD_BUF_EMPTY_THLD_S)
#define I3C_MST_REG_CMD_BUF_EMPTY_THLD_V  0x0000000FU
#define I3C_MST_REG_CMD_BUF_EMPTY_THLD_S  0
/** I3C_MST_REG_RESP_BUF_THLD : R/W; bitpos: [8:6]; default: 1;
 *  Response Buffer Threshold Value is used to control the number of entries in the
 *  Response Buffer that trigger the RESP_READY_STAT_INTR.
 */
#define I3C_MST_REG_RESP_BUF_THLD    0x00000007U
#define I3C_MST_REG_RESP_BUF_THLD_M  (I3C_MST_REG_RESP_BUF_THLD_V << I3C_MST_REG_RESP_BUF_THLD_S)
#define I3C_MST_REG_RESP_BUF_THLD_V  0x00000007U
#define I3C_MST_REG_RESP_BUF_THLD_S  6
/** I3C_MST_REG_IBI_DATA_BUF_THLD : R/W; bitpos: [14:12]; default: 1;
 *  In-Band Interrupt Data Threshold Value . Every In Band Interrupt received by I3C
 *  controller generates an IBI status. This field controls the number of IBI data
 *  entries in the IBI buffer that trigger the IBI_DATA_THLD_STAT interrupt.
 */
#define I3C_MST_REG_IBI_DATA_BUF_THLD    0x00000007U
#define I3C_MST_REG_IBI_DATA_BUF_THLD_M  (I3C_MST_REG_IBI_DATA_BUF_THLD_V << I3C_MST_REG_IBI_DATA_BUF_THLD_S)
#define I3C_MST_REG_IBI_DATA_BUF_THLD_V  0x00000007U
#define I3C_MST_REG_IBI_DATA_BUF_THLD_S  12
/** I3C_MST_REG_IBI_STATUS_BUF_THLD : R/W; bitpos: [20:18]; default: 1;
 *  NA
 */
#define I3C_MST_REG_IBI_STATUS_BUF_THLD    0x00000007U
#define I3C_MST_REG_IBI_STATUS_BUF_THLD_M  (I3C_MST_REG_IBI_STATUS_BUF_THLD_V << I3C_MST_REG_IBI_STATUS_BUF_THLD_S)
#define I3C_MST_REG_IBI_STATUS_BUF_THLD_V  0x00000007U
#define I3C_MST_REG_IBI_STATUS_BUF_THLD_S  18

/** I3C_MST_DATA_BUFFER_THLD_CTRL_REG register
 *  NA
 */
#define I3C_MST_DATA_BUFFER_THLD_CTRL_REG (DR_REG_I3C_MST_BASE + 0x20)
/** I3C_MST_REG_TX_DATA_BUF_THLD : R/W; bitpos: [2:0]; default: 1;
 *  Transmit Buffer Threshold Value. This field controls the number of empty locations
 *  in the Transmit FIFO that trigger the TX_THLD_STAT interrupt. Supports values:
 *  000:2  001:4  010:8  011:16  100:31, else:31
 */
#define I3C_MST_REG_TX_DATA_BUF_THLD    0x00000007U
#define I3C_MST_REG_TX_DATA_BUF_THLD_M  (I3C_MST_REG_TX_DATA_BUF_THLD_V << I3C_MST_REG_TX_DATA_BUF_THLD_S)
#define I3C_MST_REG_TX_DATA_BUF_THLD_V  0x00000007U
#define I3C_MST_REG_TX_DATA_BUF_THLD_S  0
/** I3C_MST_REG_RX_DATA_BUF_THLD : R/W; bitpos: [5:3]; default: 1;
 *  Receive Buffer Threshold Value. This field controls the number of empty locations
 *  in the Receive FIFO that trigger the RX_THLD_STAT interrupt. Supports: 000:2  001:4
 *  010:8  011:16  100:31, else:31
 */
#define I3C_MST_REG_RX_DATA_BUF_THLD    0x00000007U
#define I3C_MST_REG_RX_DATA_BUF_THLD_M  (I3C_MST_REG_RX_DATA_BUF_THLD_V << I3C_MST_REG_RX_DATA_BUF_THLD_S)
#define I3C_MST_REG_RX_DATA_BUF_THLD_V  0x00000007U
#define I3C_MST_REG_RX_DATA_BUF_THLD_S  3

