espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_reg.h
/** I3C_MST_IBI_NOTIFY_CTRL_REG register
 *  NA
 */
#define I3C_MST_IBI_NOTIFY_CTRL_REG (DR_REG_I3C_MST_BASE + 0x24)
/** I3C_MST_REG_NOTIFY_SIR_REJECTED : R/W; bitpos: [2]; default: 0;
 *  Notify Rejected Slave Interrupt Request Control. This bit is used to suppress
 *  reporting to the application about Slave Interrupt Request. 0:Suppress passing the
 *  IBI Status to the IBI FIFO(hence not notifying the application) when a SIR request
 *  is NACKed and auto-disabled base on the IBI_SIR_REQ_REJECT register. 1: Writes IBI
 *  Status to the IBI FIFO(hence notifying the application) when SIR request is NACKed
 *  and auto-disabled based on the IBI_SIR_REQ_REJECT registerl.
 */
#define I3C_MST_REG_NOTIFY_SIR_REJECTED    (BIT(2))
#define I3C_MST_REG_NOTIFY_SIR_REJECTED_M  (I3C_MST_REG_NOTIFY_SIR_REJECTED_V << I3C_MST_REG_NOTIFY_SIR_REJECTED_S)
#define I3C_MST_REG_NOTIFY_SIR_REJECTED_V  0x00000001U
#define I3C_MST_REG_NOTIFY_SIR_REJECTED_S  2

/** I3C_MST_IBI_SIR_REQ_PAYLOAD_REG register
 *  NA
 */
#define I3C_MST_IBI_SIR_REQ_PAYLOAD_REG (DR_REG_I3C_MST_BASE + 0x28)
/** I3C_MST_REG_SIR_REQ_PAYLOAD : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_REG_SIR_REQ_PAYLOAD    0xFFFFFFFFU
#define I3C_MST_REG_SIR_REQ_PAYLOAD_M  (I3C_MST_REG_SIR_REQ_PAYLOAD_V << I3C_MST_REG_SIR_REQ_PAYLOAD_S)
#define I3C_MST_REG_SIR_REQ_PAYLOAD_V  0xFFFFFFFFU
#define I3C_MST_REG_SIR_REQ_PAYLOAD_S  0

/** I3C_MST_IBI_SIR_REQ_REJECT_REG register
 *  NA
 */
#define I3C_MST_IBI_SIR_REQ_REJECT_REG (DR_REG_I3C_MST_BASE + 0x2c)
/** I3C_MST_REG_SIR_REQ_REJECT : R/W; bitpos: [31:0]; default: 0;
 *  The application of controller can decide whether to send ACK or NACK for Slave
 *  request received from any I3C device. A device specific response control bit is
 *  provided to select the response option, Master will ACK/NACK the Master Request
 *  based on programming of control bit, corresponding to the interrupting device.
 *  0:ACK the SIR Request  1:NACK and send direct auto disable CCC
 */
#define I3C_MST_REG_SIR_REQ_REJECT    0xFFFFFFFFU
#define I3C_MST_REG_SIR_REQ_REJECT_M  (I3C_MST_REG_SIR_REQ_REJECT_V << I3C_MST_REG_SIR_REQ_REJECT_S)
#define I3C_MST_REG_SIR_REQ_REJECT_V  0xFFFFFFFFU
#define I3C_MST_REG_SIR_REQ_REJECT_S  0

/** I3C_MST_INT_CLR_REG register
 *  NA
 */
#define I3C_MST_INT_CLR_REG (DR_REG_I3C_MST_BASE + 0x30)
/** I3C_MST_TX_DATA_BUF_THLD_INT_CLR : WT; bitpos: [0]; default: 0;
 *  NA
 */
#define I3C_MST_TX_DATA_BUF_THLD_INT_CLR    (BIT(0))
#define I3C_MST_TX_DATA_BUF_THLD_INT_CLR_M  (I3C_MST_TX_DATA_BUF_THLD_INT_CLR_V << I3C_MST_TX_DATA_BUF_THLD_INT_CLR_S)
#define I3C_MST_TX_DATA_BUF_THLD_INT_CLR_V  0x00000001U
#define I3C_MST_TX_DATA_BUF_THLD_INT_CLR_S  0
/** I3C_MST_RX_DATA_BUF_THLD_INT_CLR : WT; bitpos: [1]; default: 0;
 *  NA
 */
#define I3C_MST_RX_DATA_BUF_THLD_INT_CLR    (BIT(1))
#define I3C_MST_RX_DATA_BUF_THLD_INT_CLR_M  (I3C_MST_RX_DATA_BUF_THLD_INT_CLR_V << I3C_MST_RX_DATA_BUF_THLD_INT_CLR_S)
#define I3C_MST_RX_DATA_BUF_THLD_INT_CLR_V  0x00000001U
#define I3C_MST_RX_DATA_BUF_THLD_INT_CLR_S  1
/** I3C_MST_IBI_STATUS_THLD_INT_CLR : WT; bitpos: [2]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_STATUS_THLD_INT_CLR    (BIT(2))
#define I3C_MST_IBI_STATUS_THLD_INT_CLR_M  (I3C_MST_IBI_STATUS_THLD_INT_CLR_V << I3C_MST_IBI_STATUS_THLD_INT_CLR_S)
#define I3C_MST_IBI_STATUS_THLD_INT_CLR_V  0x00000001U
#define I3C_MST_IBI_STATUS_THLD_INT_CLR_S  2
/** I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR : WT; bitpos: [3]; default: 0;
 *  NA
 */
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR    (BIT(3))
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR_M  (I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR_V << I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR_S)
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR_V  0x00000001U
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_CLR_S  3
/** I3C_MST_RESP_READY_INT_CLR : WT; bitpos: [4]; default: 0;
 *  NA
 */
#define I3C_MST_RESP_READY_INT_CLR    (BIT(4))
#define I3C_MST_RESP_READY_INT_CLR_M  (I3C_MST_RESP_READY_INT_CLR_V << I3C_MST_RESP_READY_INT_CLR_S)
#define I3C_MST_RESP_READY_INT_CLR_V  0x00000001U
#define I3C_MST_RESP_READY_INT_CLR_S  4
/** I3C_MST_NXT_CMD_REQ_ERR_INT_CLR : WT; bitpos: [5]; default: 0;
 *  NA
 */
#define I3C_MST_NXT_CMD_REQ_ERR_INT_CLR    (BIT(5))
#define I3C_MST_NXT_CMD_REQ_ERR_INT_CLR_M  (I3C_MST_NXT_CMD_REQ_ERR_INT_CLR_V << I3C_MST_NXT_CMD_REQ_ERR_INT_CLR_S)
#define I3C_MST_NXT_CMD_REQ_ERR_INT_CLR_V  0x00000001U
#define I3C_MST_NXT_CMD_REQ_ERR_INT_CLR_S  5
/** I3C_MST_TRANSFER_ERR_INT_CLR : WT; bitpos: [6]; default: 0;
 *  NA
 */
#define I3C_MST_TRANSFER_ERR_INT_CLR    (BIT(6))
#define I3C_MST_TRANSFER_ERR_INT_CLR_M  (I3C_MST_TRANSFER_ERR_INT_CLR_V << I3C_MST_TRANSFER_ERR_INT_CLR_S)
#define I3C_MST_TRANSFER_ERR_INT_CLR_V  0x00000001U
#define I3C_MST_TRANSFER_ERR_INT_CLR_S  6
/** I3C_MST_TRANSFER_COMPLETE_INT_CLR : WT; bitpos: [7]; default: 0;
 *  NA
 */
#define I3C_MST_TRANSFER_COMPLETE_INT_CLR    (BIT(7))
#define I3C_MST_TRANSFER_COMPLETE_INT_CLR_M  (I3C_MST_TRANSFER_COMPLETE_INT_CLR_V << I3C_MST_TRANSFER_COMPLETE_INT_CLR_S)
#define I3C_MST_TRANSFER_COMPLETE_INT_CLR_V  0x00000001U
#define I3C_MST_TRANSFER_COMPLETE_INT_CLR_S  7
/** I3C_MST_COMMAND_DONE_INT_CLR : WT; bitpos: [8]; default: 0;
 *  NA
 */
#define I3C_MST_COMMAND_DONE_INT_CLR    (BIT(8))
#define I3C_MST_COMMAND_DONE_INT_CLR_M  (I3C_MST_COMMAND_DONE_INT_CLR_V << I3C_MST_COMMAND_DONE_INT_CLR_S)
#define I3C_MST_COMMAND_DONE_INT_CLR_V  0x00000001U
#define I3C_MST_COMMAND_DONE_INT_CLR_S  8
/** I3C_MST_DETECT_START_INT_CLR : WT; bitpos: [9]; default: 0;
 *  NA
 */
#define I3C_MST_DETECT_START_INT_CLR    (BIT(9))
#define I3C_MST_DETECT_START_INT_CLR_M  (I3C_MST_DETECT_START_INT_CLR_V << I3C_MST_DETECT_START_INT_CLR_S)
#define I3C_MST_DETECT_START_INT_CLR_V  0x00000001U
#define I3C_MST_DETECT_START_INT_CLR_S  9
/** I3C_MST_RESP_BUF_OVF_INT_CLR : WT; bitpos: [10]; default: 0;
 *  NA
 */
#define I3C_MST_RESP_BUF_OVF_INT_CLR    (BIT(10))
#define I3C_MST_RESP_BUF_OVF_INT_CLR_M  (I3C_MST_RESP_BUF_OVF_INT_CLR_V << I3C_MST_RESP_BUF_OVF_INT_CLR_S)
#define I3C_MST_RESP_BUF_OVF_INT_CLR_V  0x00000001U
#define I3C_MST_RESP_BUF_OVF_INT_CLR_S  10
/** I3C_MST_IBI_DATA_BUF_OVF_INT_CLR : WT; bitpos: [11]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DATA_BUF_OVF_INT_CLR    (BIT(11))
#define I3C_MST_IBI_DATA_BUF_OVF_INT_CLR_M  (I3C_MST_IBI_DATA_BUF_OVF_INT_CLR_V << I3C_MST_IBI_DATA_BUF_OVF_INT_CLR_S)
#define I3C_MST_IBI_DATA_BUF_OVF_INT_CLR_V  0x00000001U
#define I3C_MST_IBI_DATA_BUF_OVF_INT_CLR_S  11
/** I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR    (BIT(12))
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR_M  (I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR_V << I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR_S)
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR_V  0x00000001U
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_CLR_S  12
/** I3C_MST_IBI_HANDLE_DONE_INT_CLR : WT; bitpos: [13]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_HANDLE_DONE_INT_CLR    (BIT(13))
#define I3C_MST_IBI_HANDLE_DONE_INT_CLR_M  (I3C_MST_IBI_HANDLE_DONE_INT_CLR_V << I3C_MST_IBI_HANDLE_DONE_INT_CLR_S)
#define I3C_MST_IBI_HANDLE_DONE_INT_CLR_V  0x00000001U
#define I3C_MST_IBI_HANDLE_DONE_INT_CLR_S  13
/** I3C_MST_IBI_DETECT_INT_CLR : WT; bitpos: [14]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DETECT_INT_CLR    (BIT(14))
#define I3C_MST_IBI_DETECT_INT_CLR_M  (I3C_MST_IBI_DETECT_INT_CLR_V << I3C_MST_IBI_DETECT_INT_CLR_S)
#define I3C_MST_IBI_DETECT_INT_CLR_V  0x00000001U
#define I3C_MST_IBI_DETECT_INT_CLR_S  14
/** I3C_MST_CMD_CCC_MISMATCH_INT_CLR : WT; bitpos: [15]; default: 0;
 *  NA
 */
#define I3C_MST_CMD_CCC_MISMATCH_INT_CLR    (BIT(15))
#define I3C_MST_CMD_CCC_MISMATCH_INT_CLR_M  (I3C_MST_CMD_CCC_MISMATCH_INT_CLR_V << I3C_MST_CMD_CCC_MISMATCH_INT_CLR_S)
#define I3C_MST_CMD_CCC_MISMATCH_INT_CLR_V  0x00000001U
#define I3C_MST_CMD_CCC_MISMATCH_INT_CLR_S  15

/** I3C_MST_INT_RAW_REG register
 *  NA
 */
#define I3C_MST_INT_RAW_REG (DR_REG_I3C_MST_BASE + 0x34)
/** I3C_MST_TX_DATA_BUF_THLD_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  NA
 */
#define I3C_MST_TX_DATA_BUF_THLD_INT_RAW    (BIT(0))
#define I3C_MST_TX_DATA_BUF_THLD_INT_RAW_M  (I3C_MST_TX_DATA_BUF_THLD_INT_RAW_V << I3C_MST_TX_DATA_BUF_THLD_INT_RAW_S)
#define I3C_MST_TX_DATA_BUF_THLD_INT_RAW_V  0x00000001U
#define I3C_MST_TX_DATA_BUF_THLD_INT_RAW_S  0
/** I3C_MST_RX_DATA_BUF_THLD_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  NA
 */
#define I3C_MST_RX_DATA_BUF_THLD_INT_RAW    (BIT(1))
#define I3C_MST_RX_DATA_BUF_THLD_INT_RAW_M  (I3C_MST_RX_DATA_BUF_THLD_INT_RAW_V << I3C_MST_RX_DATA_BUF_THLD_INT_RAW_S)
#define I3C_MST_RX_DATA_BUF_THLD_INT_RAW_V  0x00000001U
#define I3C_MST_RX_DATA_BUF_THLD_INT_RAW_S  1
/** I3C_MST_IBI_STATUS_THLD_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_STATUS_THLD_INT_RAW    (BIT(2))
#define I3C_MST_IBI_STATUS_THLD_INT_RAW_M  (I3C_MST_IBI_STATUS_THLD_INT_RAW_V << I3C_MST_IBI_STATUS_THLD_INT_RAW_S)
#define I3C_MST_IBI_STATUS_THLD_INT_RAW_V  0x00000001U
#define I3C_MST_IBI_STATUS_THLD_INT_RAW_S  2
/** I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW : R/WTC/SS; bitpos: [3]; default: 1;
 *  NA
 */
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW    (BIT(3))
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW_M  (I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW_V << I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW_S)
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW_V  0x00000001U
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_RAW_S  3
/** I3C_MST_RESP_READY_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  NA
 */
#define I3C_MST_RESP_READY_INT_RAW    (BIT(4))
#define I3C_MST_RESP_READY_INT_RAW_M  (I3C_MST_RESP_READY_INT_RAW_V << I3C_MST_RESP_READY_INT_RAW_S)
#define I3C_MST_RESP_READY_INT_RAW_V  0x00000001U
#define I3C_MST_RESP_READY_INT_RAW_S  4
/** I3C_MST_NXT_CMD_REQ_ERR_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  NA
 */
#define I3C_MST_NXT_CMD_REQ_ERR_INT_RAW    (BIT(5))
#define I3C_MST_NXT_CMD_REQ_ERR_INT_RAW_M  (I3C_MST_NXT_CMD_REQ_ERR_INT_RAW_V << I3C_MST_NXT_CMD_REQ_ERR_INT_RAW_S)
#define I3C_MST_NXT_CMD_REQ_ERR_INT_RAW_V  0x00000001U
#define I3C_MST_NXT_CMD_REQ_ERR_INT_RAW_S  5
/** I3C_MST_TRANSFER_ERR_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  NA
 */
#define I3C_MST_TRANSFER_ERR_INT_RAW    (BIT(6))
#define I3C_MST_TRANSFER_ERR_INT_RAW_M  (I3C_MST_TRANSFER_ERR_INT_RAW_V << I3C_MST_TRANSFER_ERR_INT_RAW_S)
#define I3C_MST_TRANSFER_ERR_INT_RAW_V  0x00000001U
#define I3C_MST_TRANSFER_ERR_INT_RAW_S  6
/** I3C_MST_TRANSFER_COMPLETE_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  NA
 */
#define I3C_MST_TRANSFER_COMPLETE_INT_RAW    (BIT(7))
#define I3C_MST_TRANSFER_COMPLETE_INT_RAW_M  (I3C_MST_TRANSFER_COMPLETE_INT_RAW_V << I3C_MST_TRANSFER_COMPLETE_INT_RAW_S)
#define I3C_MST_TRANSFER_COMPLETE_INT_RAW_V  0x00000001U
#define I3C_MST_TRANSFER_COMPLETE_INT_RAW_S  7
/** I3C_MST_COMMAND_DONE_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  NA
 */
#define I3C_MST_COMMAND_DONE_INT_RAW    (BIT(8))
#define I3C_MST_COMMAND_DONE_INT_RAW_M  (I3C_MST_COMMAND_DONE_INT_RAW_V << I3C_MST_COMMAND_DONE_INT_RAW_S)
#define I3C_MST_COMMAND_DONE_INT_RAW_V  0x00000001U
#define I3C_MST_COMMAND_DONE_INT_RAW_S  8
/** I3C_MST_DETECT_START_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  NA
 */
#define I3C_MST_DETECT_START_INT_RAW    (BIT(9))
#define I3C_MST_DETECT_START_INT_RAW_M  (I3C_MST_DETECT_START_INT_RAW_V << I3C_MST_DETECT_START_INT_RAW_S)
#define I3C_MST_DETECT_START_INT_RAW_V  0x00000001U
#define I3C_MST_DETECT_START_INT_RAW_S  9
/** I3C_MST_RESP_BUF_OVF_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  NA
 */
#define I3C_MST_RESP_BUF_OVF_INT_RAW    (BIT(10))
#define I3C_MST_RESP_BUF_OVF_INT_RAW_M  (I3C_MST_RESP_BUF_OVF_INT_RAW_V << I3C_MST_RESP_BUF_OVF_INT_RAW_S)
#define I3C_MST_RESP_BUF_OVF_INT_RAW_V  0x00000001U
#define I3C_MST_RESP_BUF_OVF_INT_RAW_S  10
/** I3C_MST_IBI_DATA_BUF_OVF_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DATA_BUF_OVF_INT_RAW    (BIT(11))
#define I3C_MST_IBI_DATA_BUF_OVF_INT_RAW_M  (I3C_MST_IBI_DATA_BUF_OVF_INT_RAW_V << I3C_MST_IBI_DATA_BUF_OVF_INT_RAW_S)
#define I3C_MST_IBI_DATA_BUF_OVF_INT_RAW_V  0x00000001U
#define I3C_MST_IBI_DATA_BUF_OVF_INT_RAW_S  11
/** I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW    (BIT(12))
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW_M  (I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW_V << I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW_S)
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW_V  0x00000001U
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_RAW_S  12
/** I3C_MST_IBI_HANDLE_DONE_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_HANDLE_DONE_INT_RAW    (BIT(13))
#define I3C_MST_IBI_HANDLE_DONE_INT_RAW_M  (I3C_MST_IBI_HANDLE_DONE_INT_RAW_V << I3C_MST_IBI_HANDLE_DONE_INT_RAW_S)
#define I3C_MST_IBI_HANDLE_DONE_INT_RAW_V  0x00000001U
#define I3C_MST_IBI_HANDLE_DONE_INT_RAW_S  13
/** I3C_MST_IBI_DETECT_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DETECT_INT_RAW    (BIT(14))
#define I3C_MST_IBI_DETECT_INT_RAW_M  (I3C_MST_IBI_DETECT_INT_RAW_V << I3C_MST_IBI_DETECT_INT_RAW_S)
#define I3C_MST_IBI_DETECT_INT_RAW_V  0x00000001U
#define I3C_MST_IBI_DETECT_INT_RAW_S  14
/** I3C_MST_CMD_CCC_MISMATCH_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  NA
 */
#define I3C_MST_CMD_CCC_MISMATCH_INT_RAW    (BIT(15))
#define I3C_MST_CMD_CCC_MISMATCH_INT_RAW_M  (I3C_MST_CMD_CCC_MISMATCH_INT_RAW_V << I3C_MST_CMD_CCC_MISMATCH_INT_RAW_S)
#define I3C_MST_CMD_CCC_MISMATCH_INT_RAW_V  0x00000001U
#define I3C_MST_CMD_CCC_MISMATCH_INT_RAW_S  15

/** I3C_MST_INT_ST_REG register
 *  NA
 */
#define I3C_MST_INT_ST_REG (DR_REG_I3C_MST_BASE + 0x38)
/** I3C_MST_TX_DATA_BUF_THLD_INT_ST : RO; bitpos: [0]; default: 0;
 *  This interrupt is generated when number of empty locations in transmit buffer is
 *  greater than or equal to threshold value specified by TX_EMPTY_BUS_THLD field in
 *  DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when
 *  number of empty locations in transmit buffer is less than threshold value.
 */
#define I3C_MST_TX_DATA_BUF_THLD_INT_ST    (BIT(0))
#define I3C_MST_TX_DATA_BUF_THLD_INT_ST_M  (I3C_MST_TX_DATA_BUF_THLD_INT_ST_V << I3C_MST_TX_DATA_BUF_THLD_INT_ST_S)
#define I3C_MST_TX_DATA_BUF_THLD_INT_ST_V  0x00000001U
#define I3C_MST_TX_DATA_BUF_THLD_INT_ST_S  0
/** I3C_MST_RX_DATA_BUF_THLD_INT_ST : RO; bitpos: [1]; default: 0;
 *  This interrupt is generated when number of entries in receive buffer is greater
 *  than or equal to threshold value specified by RX_BUF_THLD field in
 *  DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when
 *  number of entries in receive buffer is less than threshold value.
 */
#define I3C_MST_RX_DATA_BUF_THLD_INT_ST    (BIT(1))
#define I3C_MST_RX_DATA_BUF_THLD_INT_ST_M  (I3C_MST_RX_DATA_BUF_THLD_INT_ST_V << I3C_MST_RX_DATA_BUF_THLD_INT_ST_S)
#define I3C_MST_RX_DATA_BUF_THLD_INT_ST_V  0x00000001U
#define I3C_MST_RX_DATA_BUF_THLD_INT_ST_S  1
/** I3C_MST_IBI_STATUS_THLD_INT_ST : RO; bitpos: [2]; default: 0;
 *  Only used in master mode. This interrupt is generated when number of entries in IBI
 *  buffer is greater than or equal to threshold value specified by IBI_BUF_THLD field
 *  in BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when
 *  number of entries in IBI buffer is less than threshold value.
 */
#define I3C_MST_IBI_STATUS_THLD_INT_ST    (BIT(2))
#define I3C_MST_IBI_STATUS_THLD_INT_ST_M  (I3C_MST_IBI_STATUS_THLD_INT_ST_V << I3C_MST_IBI_STATUS_THLD_INT_ST_S)
#define I3C_MST_IBI_STATUS_THLD_INT_ST_V  0x00000001U
#define I3C_MST_IBI_STATUS_THLD_INT_ST_S  2
/** I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST : RO; bitpos: [3]; default: 0;
 *  This interrupt is generated when number of empty locations in command buffer is
 *  greater than or equal to threshold value specified by CMD_EMPTY_BUF_THLD field in
 *  BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number
 *  of empty locations in command buffer is less than threshold value.
 */
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST    (BIT(3))
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST_M  (I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST_V << I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST_S)
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST_V  0x00000001U
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ST_S  3
/** I3C_MST_RESP_READY_INT_ST : RO; bitpos: [4]; default: 0;
 *  This interrupt is generated when number of entries in response buffer is greater
 *  than or equal to threshold value specified by RESP_BUF_THLD field in
 *  BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number
 *  of entries in response buffer is less than threshold value.
 */
#define I3C_MST_RESP_READY_INT_ST    (BIT(4))
#define I3C_MST_RESP_READY_INT_ST_M  (I3C_MST_RESP_READY_INT_ST_V << I3C_MST_RESP_READY_INT_ST_S)
#define I3C_MST_RESP_READY_INT_ST_V  0x00000001U
#define I3C_MST_RESP_READY_INT_ST_S  4
/** I3C_MST_NXT_CMD_REQ_ERR_INT_ST : RO; bitpos: [5]; default: 0;
 *  This interrupt is generated if toc is 0(master will restart next command), but
 *  command buf is empty.
 */
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ST    (BIT(5))
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ST_M  (I3C_MST_NXT_CMD_REQ_ERR_INT_ST_V << I3C_MST_NXT_CMD_REQ_ERR_INT_ST_S)
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ST_V  0x00000001U
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ST_S  5
/** I3C_MST_TRANSFER_ERR_INT_ST : RO; bitpos: [6]; default: 0;
 *  This interrupt is generated if any error occurs during transfer. The error type
 *  will be specified in the response packet associated with the command (in ERR_STATUS
 *  field of RESPONSE_BUFFER_PORT register). This bit can be cleared by writing 1'h1.
 */
#define I3C_MST_TRANSFER_ERR_INT_ST    (BIT(6))
#define I3C_MST_TRANSFER_ERR_INT_ST_M  (I3C_MST_TRANSFER_ERR_INT_ST_V << I3C_MST_TRANSFER_ERR_INT_ST_S)
#define I3C_MST_TRANSFER_ERR_INT_ST_V  0x00000001U
#define I3C_MST_TRANSFER_ERR_INT_ST_S  6
/** I3C_MST_TRANSFER_COMPLETE_INT_ST : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define I3C_MST_TRANSFER_COMPLETE_INT_ST    (BIT(7))
#define I3C_MST_TRANSFER_COMPLETE_INT_ST_M  (I3C_MST_TRANSFER_COMPLETE_INT_ST_V << I3C_MST_TRANSFER_COMPLETE_INT_ST_S)
#define I3C_MST_TRANSFER_COMPLETE_INT_ST_V  0x00000001U
#define I3C_MST_TRANSFER_COMPLETE_INT_ST_S  7
/** I3C_MST_COMMAND_DONE_INT_ST : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define I3C_MST_COMMAND_DONE_INT_ST    (BIT(8))
#define I3C_MST_COMMAND_DONE_INT_ST_M  (I3C_MST_COMMAND_DONE_INT_ST_V << I3C_MST_COMMAND_DONE_INT_ST_S)
#define I3C_MST_COMMAND_DONE_INT_ST_V  0x00000001U
#define I3C_MST_COMMAND_DONE_INT_ST_S  8
/** I3C_MST_DETECT_START_INT_ST : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define I3C_MST_DETECT_START_INT_ST    (BIT(9))
#define I3C_MST_DETECT_START_INT_ST_M  (I3C_MST_DETECT_START_INT_ST_V << I3C_MST_DETECT_START_INT_ST_S)
#define I3C_MST_DETECT_START_INT_ST_V  0x00000001U
#define I3C_MST_DETECT_START_INT_ST_S  9
/** I3C_MST_RESP_BUF_OVF_INT_ST : RO; bitpos: [10]; default: 0;
 *  NA
 */
#define I3C_MST_RESP_BUF_OVF_INT_ST    (BIT(10))
#define I3C_MST_RESP_BUF_OVF_INT_ST_M  (I3C_MST_RESP_BUF_OVF_INT_ST_V << I3C_MST_RESP_BUF_OVF_INT_ST_S)
#define I3C_MST_RESP_BUF_OVF_INT_ST_V  0x00000001U
#define I3C_MST_RESP_BUF_OVF_INT_ST_S  10
/** I3C_MST_IBI_DATA_BUF_OVF_INT_ST : RO; bitpos: [11]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ST    (BIT(11))
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ST_M  (I3C_MST_IBI_DATA_BUF_OVF_INT_ST_V << I3C_MST_IBI_DATA_BUF_OVF_INT_ST_S)
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ST_V  0x00000001U
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ST_S  11
/** I3C_MST_IBI_STATUS_BUF_OVF_INT_ST : RO; bitpos: [12]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ST    (BIT(12))
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ST_M  (I3C_MST_IBI_STATUS_BUF_OVF_INT_ST_V << I3C_MST_IBI_STATUS_BUF_OVF_INT_ST_S)
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ST_V  0x00000001U
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ST_S  12
/** I3C_MST_IBI_HANDLE_DONE_INT_ST : RO; bitpos: [13]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_HANDLE_DONE_INT_ST    (BIT(13))
#define I3C_MST_IBI_HANDLE_DONE_INT_ST_M  (I3C_MST_IBI_HANDLE_DONE_INT_ST_V << I3C_MST_IBI_HANDLE_DONE_INT_ST_S)
#define I3C_MST_IBI_HANDLE_DONE_INT_ST_V  0x00000001U
#define I3C_MST_IBI_HANDLE_DONE_INT_ST_S  13
/** I3C_MST_IBI_DETECT_INT_ST : RO; bitpos: [14]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DETECT_INT_ST    (BIT(14))
#define I3C_MST_IBI_DETECT_INT_ST_M  (I3C_MST_IBI_DETECT_INT_ST_V << I3C_MST_IBI_DETECT_INT_ST_S)
#define I3C_MST_IBI_DETECT_INT_ST_V  0x00000001U
#define I3C_MST_IBI_DETECT_INT_ST_S  14
/** I3C_MST_CMD_CCC_MISMATCH_INT_ST : RO; bitpos: [15]; default: 0;
 *  NA
 */
#define I3C_MST_CMD_CCC_MISMATCH_INT_ST    (BIT(15))
#define I3C_MST_CMD_CCC_MISMATCH_INT_ST_M  (I3C_MST_CMD_CCC_MISMATCH_INT_ST_V << I3C_MST_CMD_CCC_MISMATCH_INT_ST_S)
#define I3C_MST_CMD_CCC_MISMATCH_INT_ST_V  0x00000001U
#define I3C_MST_CMD_CCC_MISMATCH_INT_ST_S  15

