espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_reg.h
/** I3C_MST_INT_ST_ENA_REG register
 *  The Interrupt status will be updated in INTR_STATUS register if corresponding
 *  Status Enable bit set.
 */
#define I3C_MST_INT_ST_ENA_REG (DR_REG_I3C_MST_BASE + 0x3c)
/** I3C_MST_TX_DATA_BUF_THLD_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Transmit Buffer threshold status enable.
 */
#define I3C_MST_TX_DATA_BUF_THLD_INT_ENA    (BIT(0))
#define I3C_MST_TX_DATA_BUF_THLD_INT_ENA_M  (I3C_MST_TX_DATA_BUF_THLD_INT_ENA_V << I3C_MST_TX_DATA_BUF_THLD_INT_ENA_S)
#define I3C_MST_TX_DATA_BUF_THLD_INT_ENA_V  0x00000001U
#define I3C_MST_TX_DATA_BUF_THLD_INT_ENA_S  0
/** I3C_MST_RX_DATA_BUF_THLD_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Receive Buffer threshold status enable.
 */
#define I3C_MST_RX_DATA_BUF_THLD_INT_ENA    (BIT(1))
#define I3C_MST_RX_DATA_BUF_THLD_INT_ENA_M  (I3C_MST_RX_DATA_BUF_THLD_INT_ENA_V << I3C_MST_RX_DATA_BUF_THLD_INT_ENA_S)
#define I3C_MST_RX_DATA_BUF_THLD_INT_ENA_V  0x00000001U
#define I3C_MST_RX_DATA_BUF_THLD_INT_ENA_S  1
/** I3C_MST_IBI_STATUS_THLD_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Only used in master mode. IBI Buffer threshold status enable.
 */
#define I3C_MST_IBI_STATUS_THLD_INT_ENA    (BIT(2))
#define I3C_MST_IBI_STATUS_THLD_INT_ENA_M  (I3C_MST_IBI_STATUS_THLD_INT_ENA_V << I3C_MST_IBI_STATUS_THLD_INT_ENA_S)
#define I3C_MST_IBI_STATUS_THLD_INT_ENA_V  0x00000001U
#define I3C_MST_IBI_STATUS_THLD_INT_ENA_S  2
/** I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Command buffer ready status enable.
 */
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA    (BIT(3))
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA_M  (I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA_V << I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA_S)
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA_V  0x00000001U
#define I3C_MST_CMD_BUF_EMPTY_THLD_INT_ENA_S  3
/** I3C_MST_RESP_READY_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Response buffer ready status enable.
 */
#define I3C_MST_RESP_READY_INT_ENA    (BIT(4))
#define I3C_MST_RESP_READY_INT_ENA_M  (I3C_MST_RESP_READY_INT_ENA_V << I3C_MST_RESP_READY_INT_ENA_S)
#define I3C_MST_RESP_READY_INT_ENA_V  0x00000001U
#define I3C_MST_RESP_READY_INT_ENA_S  4
/** I3C_MST_NXT_CMD_REQ_ERR_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  next command request error status enable
 */
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ENA    (BIT(5))
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ENA_M  (I3C_MST_NXT_CMD_REQ_ERR_INT_ENA_V << I3C_MST_NXT_CMD_REQ_ERR_INT_ENA_S)
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ENA_V  0x00000001U
#define I3C_MST_NXT_CMD_REQ_ERR_INT_ENA_S  5
/** I3C_MST_TRANSFER_ERR_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Transfer error status enable
 */
#define I3C_MST_TRANSFER_ERR_INT_ENA    (BIT(6))
#define I3C_MST_TRANSFER_ERR_INT_ENA_M  (I3C_MST_TRANSFER_ERR_INT_ENA_V << I3C_MST_TRANSFER_ERR_INT_ENA_S)
#define I3C_MST_TRANSFER_ERR_INT_ENA_V  0x00000001U
#define I3C_MST_TRANSFER_ERR_INT_ENA_S  6
/** I3C_MST_TRANSFER_COMPLETE_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define I3C_MST_TRANSFER_COMPLETE_INT_ENA    (BIT(7))
#define I3C_MST_TRANSFER_COMPLETE_INT_ENA_M  (I3C_MST_TRANSFER_COMPLETE_INT_ENA_V << I3C_MST_TRANSFER_COMPLETE_INT_ENA_S)
#define I3C_MST_TRANSFER_COMPLETE_INT_ENA_V  0x00000001U
#define I3C_MST_TRANSFER_COMPLETE_INT_ENA_S  7
/** I3C_MST_COMMAND_DONE_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define I3C_MST_COMMAND_DONE_INT_ENA    (BIT(8))
#define I3C_MST_COMMAND_DONE_INT_ENA_M  (I3C_MST_COMMAND_DONE_INT_ENA_V << I3C_MST_COMMAND_DONE_INT_ENA_S)
#define I3C_MST_COMMAND_DONE_INT_ENA_V  0x00000001U
#define I3C_MST_COMMAND_DONE_INT_ENA_S  8
/** I3C_MST_DETECT_START_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define I3C_MST_DETECT_START_INT_ENA    (BIT(9))
#define I3C_MST_DETECT_START_INT_ENA_M  (I3C_MST_DETECT_START_INT_ENA_V << I3C_MST_DETECT_START_INT_ENA_S)
#define I3C_MST_DETECT_START_INT_ENA_V  0x00000001U
#define I3C_MST_DETECT_START_INT_ENA_S  9
/** I3C_MST_RESP_BUF_OVF_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define I3C_MST_RESP_BUF_OVF_INT_ENA    (BIT(10))
#define I3C_MST_RESP_BUF_OVF_INT_ENA_M  (I3C_MST_RESP_BUF_OVF_INT_ENA_V << I3C_MST_RESP_BUF_OVF_INT_ENA_S)
#define I3C_MST_RESP_BUF_OVF_INT_ENA_V  0x00000001U
#define I3C_MST_RESP_BUF_OVF_INT_ENA_S  10
/** I3C_MST_IBI_DATA_BUF_OVF_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ENA    (BIT(11))
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ENA_M  (I3C_MST_IBI_DATA_BUF_OVF_INT_ENA_V << I3C_MST_IBI_DATA_BUF_OVF_INT_ENA_S)
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ENA_V  0x00000001U
#define I3C_MST_IBI_DATA_BUF_OVF_INT_ENA_S  11
/** I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA    (BIT(12))
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA_M  (I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA_V << I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA_S)
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA_V  0x00000001U
#define I3C_MST_IBI_STATUS_BUF_OVF_INT_ENA_S  12
/** I3C_MST_IBI_HANDLE_DONE_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_HANDLE_DONE_INT_ENA    (BIT(13))
#define I3C_MST_IBI_HANDLE_DONE_INT_ENA_M  (I3C_MST_IBI_HANDLE_DONE_INT_ENA_V << I3C_MST_IBI_HANDLE_DONE_INT_ENA_S)
#define I3C_MST_IBI_HANDLE_DONE_INT_ENA_V  0x00000001U
#define I3C_MST_IBI_HANDLE_DONE_INT_ENA_S  13
/** I3C_MST_IBI_DETECT_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_DETECT_INT_ENA    (BIT(14))
#define I3C_MST_IBI_DETECT_INT_ENA_M  (I3C_MST_IBI_DETECT_INT_ENA_V << I3C_MST_IBI_DETECT_INT_ENA_S)
#define I3C_MST_IBI_DETECT_INT_ENA_V  0x00000001U
#define I3C_MST_IBI_DETECT_INT_ENA_S  14
/** I3C_MST_CMD_CCC_MISMATCH_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define I3C_MST_CMD_CCC_MISMATCH_INT_ENA    (BIT(15))
#define I3C_MST_CMD_CCC_MISMATCH_INT_ENA_M  (I3C_MST_CMD_CCC_MISMATCH_INT_ENA_V << I3C_MST_CMD_CCC_MISMATCH_INT_ENA_S)
#define I3C_MST_CMD_CCC_MISMATCH_INT_ENA_V  0x00000001U
#define I3C_MST_CMD_CCC_MISMATCH_INT_ENA_S  15

/** I3C_MST_RESET_CTRL_REG register
 *  NA
 */
#define I3C_MST_RESET_CTRL_REG (DR_REG_I3C_MST_BASE + 0x44)
/** I3C_MST_REG_CORE_SOFT_RST : WT; bitpos: [0]; default: 0;
 *  NA
 */
#define I3C_MST_REG_CORE_SOFT_RST    (BIT(0))
#define I3C_MST_REG_CORE_SOFT_RST_M  (I3C_MST_REG_CORE_SOFT_RST_V << I3C_MST_REG_CORE_SOFT_RST_S)
#define I3C_MST_REG_CORE_SOFT_RST_V  0x00000001U
#define I3C_MST_REG_CORE_SOFT_RST_S  0
/** I3C_MST_REG_CMD_BUF_RST : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define I3C_MST_REG_CMD_BUF_RST    (BIT(1))
#define I3C_MST_REG_CMD_BUF_RST_M  (I3C_MST_REG_CMD_BUF_RST_V << I3C_MST_REG_CMD_BUF_RST_S)
#define I3C_MST_REG_CMD_BUF_RST_V  0x00000001U
#define I3C_MST_REG_CMD_BUF_RST_S  1
/** I3C_MST_REG_RESP_BUF_RST : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RESP_BUF_RST    (BIT(2))
#define I3C_MST_REG_RESP_BUF_RST_M  (I3C_MST_REG_RESP_BUF_RST_V << I3C_MST_REG_RESP_BUF_RST_S)
#define I3C_MST_REG_RESP_BUF_RST_V  0x00000001U
#define I3C_MST_REG_RESP_BUF_RST_S  2
/** I3C_MST_REG_TX_DATA_BUF_BUF_RST : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define I3C_MST_REG_TX_DATA_BUF_BUF_RST    (BIT(3))
#define I3C_MST_REG_TX_DATA_BUF_BUF_RST_M  (I3C_MST_REG_TX_DATA_BUF_BUF_RST_V << I3C_MST_REG_TX_DATA_BUF_BUF_RST_S)
#define I3C_MST_REG_TX_DATA_BUF_BUF_RST_V  0x00000001U
#define I3C_MST_REG_TX_DATA_BUF_BUF_RST_S  3
/** I3C_MST_REG_RX_DATA_BUF_RST : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RX_DATA_BUF_RST    (BIT(4))
#define I3C_MST_REG_RX_DATA_BUF_RST_M  (I3C_MST_REG_RX_DATA_BUF_RST_V << I3C_MST_REG_RX_DATA_BUF_RST_S)
#define I3C_MST_REG_RX_DATA_BUF_RST_V  0x00000001U
#define I3C_MST_REG_RX_DATA_BUF_RST_S  4
/** I3C_MST_REG_IBI_DATA_BUF_RST : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define I3C_MST_REG_IBI_DATA_BUF_RST    (BIT(5))
#define I3C_MST_REG_IBI_DATA_BUF_RST_M  (I3C_MST_REG_IBI_DATA_BUF_RST_V << I3C_MST_REG_IBI_DATA_BUF_RST_S)
#define I3C_MST_REG_IBI_DATA_BUF_RST_V  0x00000001U
#define I3C_MST_REG_IBI_DATA_BUF_RST_S  5
/** I3C_MST_REG_IBI_STATUS_BUF_RST : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define I3C_MST_REG_IBI_STATUS_BUF_RST    (BIT(6))
#define I3C_MST_REG_IBI_STATUS_BUF_RST_M  (I3C_MST_REG_IBI_STATUS_BUF_RST_V << I3C_MST_REG_IBI_STATUS_BUF_RST_S)
#define I3C_MST_REG_IBI_STATUS_BUF_RST_V  0x00000001U
#define I3C_MST_REG_IBI_STATUS_BUF_RST_S  6

