espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_reg.h
/** I3C_MST_BUFFER_STATUS_LEVEL_REG register
 *  BUFFER_STATUS_LEVEL reflects the status level of Buffers in the controller.
 */
#define I3C_MST_BUFFER_STATUS_LEVEL_REG (DR_REG_I3C_MST_BASE + 0x48)
/** I3C_MST_CMD_BUF_EMPTY_CNT : RO; bitpos: [4:0]; default: 16;
 *  Command Buffer Empty Locations contains the number of empty locations in the
 *  command buffer.
 */
#define I3C_MST_CMD_BUF_EMPTY_CNT    0x0000001FU
#define I3C_MST_CMD_BUF_EMPTY_CNT_M  (I3C_MST_CMD_BUF_EMPTY_CNT_V << I3C_MST_CMD_BUF_EMPTY_CNT_S)
#define I3C_MST_CMD_BUF_EMPTY_CNT_V  0x0000001FU
#define I3C_MST_CMD_BUF_EMPTY_CNT_S  0
/** I3C_MST_RESP_BUF_CNT : RO; bitpos: [11:8]; default: 0;
 *  Response Buffer Level Value contains the number of valid data entries in the
 *  response buffer.
 */
#define I3C_MST_RESP_BUF_CNT    0x0000000FU
#define I3C_MST_RESP_BUF_CNT_M  (I3C_MST_RESP_BUF_CNT_V << I3C_MST_RESP_BUF_CNT_S)
#define I3C_MST_RESP_BUF_CNT_V  0x0000000FU
#define I3C_MST_RESP_BUF_CNT_S  8
/** I3C_MST_IBI_DATA_BUF_CNT : RO; bitpos: [19:16]; default: 0;
 *  IBI Buffer Level Value contains the number of valid entries in the IBI Buffer. This
 *  is field is used in master mode.
 */
#define I3C_MST_IBI_DATA_BUF_CNT    0x0000000FU
#define I3C_MST_IBI_DATA_BUF_CNT_M  (I3C_MST_IBI_DATA_BUF_CNT_V << I3C_MST_IBI_DATA_BUF_CNT_S)
#define I3C_MST_IBI_DATA_BUF_CNT_V  0x0000000FU
#define I3C_MST_IBI_DATA_BUF_CNT_S  16
/** I3C_MST_IBI_STATUS_BUF_CNT : RO; bitpos: [27:24]; default: 0;
 *  IBI Buffer Status Count contains the number of IBI status entries in the IBI
 *  Buffer. This field is used in master mode.
 */
#define I3C_MST_IBI_STATUS_BUF_CNT    0x0000000FU
#define I3C_MST_IBI_STATUS_BUF_CNT_M  (I3C_MST_IBI_STATUS_BUF_CNT_V << I3C_MST_IBI_STATUS_BUF_CNT_S)
#define I3C_MST_IBI_STATUS_BUF_CNT_V  0x0000000FU
#define I3C_MST_IBI_STATUS_BUF_CNT_S  24

/** I3C_MST_DATA_BUFFER_STATUS_LEVEL_REG register
 *  DATA_BUFFER_STATUS_LEVEL reflects the status level of the Buffers in the controller.
 */
#define I3C_MST_DATA_BUFFER_STATUS_LEVEL_REG (DR_REG_I3C_MST_BASE + 0x4c)
/** I3C_MST_TX_DATA_BUF_EMPTY_CNT : RO; bitpos: [5:0]; default: 32;
 *  Transmit Buffer Empty Level Value contains the number of empty locations in the
 *  transmit Buffer.
 */
#define I3C_MST_TX_DATA_BUF_EMPTY_CNT    0x0000003FU
#define I3C_MST_TX_DATA_BUF_EMPTY_CNT_M  (I3C_MST_TX_DATA_BUF_EMPTY_CNT_V << I3C_MST_TX_DATA_BUF_EMPTY_CNT_S)
#define I3C_MST_TX_DATA_BUF_EMPTY_CNT_V  0x0000003FU
#define I3C_MST_TX_DATA_BUF_EMPTY_CNT_S  0
/** I3C_MST_RX_DATA_BUF_CNT : RO; bitpos: [21:16]; default: 0;
 *  Receive Buffer Level value contains the number of valid data entries in the receive
 *  buffer.
 */
#define I3C_MST_RX_DATA_BUF_CNT    0x0000003FU
#define I3C_MST_RX_DATA_BUF_CNT_M  (I3C_MST_RX_DATA_BUF_CNT_V << I3C_MST_RX_DATA_BUF_CNT_S)
#define I3C_MST_RX_DATA_BUF_CNT_V  0x0000003FU
#define I3C_MST_RX_DATA_BUF_CNT_S  16

/** I3C_MST_PRESENT_STATE0_REG register
 *  NA
 */
#define I3C_MST_PRESENT_STATE0_REG (DR_REG_I3C_MST_BASE + 0x50)
/** I3C_MST_SDA_LVL : RO; bitpos: [0]; default: 1;
 *  This bit is used to check the SCL line level to recover from error and  for
 *  debugging. This bit reflects the value of synchronized scl_in_a.
 */
#define I3C_MST_SDA_LVL    (BIT(0))
#define I3C_MST_SDA_LVL_M  (I3C_MST_SDA_LVL_V << I3C_MST_SDA_LVL_S)
#define I3C_MST_SDA_LVL_V  0x00000001U
#define I3C_MST_SDA_LVL_S  0
/** I3C_MST_SCL_LVL : RO; bitpos: [1]; default: 1;
 *  This bit is used to check the SDA line level to recover from error and  for
 *  debugging. This bit reflects the value of synchronized sda_in_a.
 */
#define I3C_MST_SCL_LVL    (BIT(1))
#define I3C_MST_SCL_LVL_M  (I3C_MST_SCL_LVL_V << I3C_MST_SCL_LVL_S)
#define I3C_MST_SCL_LVL_V  0x00000001U
#define I3C_MST_SCL_LVL_S  1
/** I3C_MST_BUS_BUSY : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define I3C_MST_BUS_BUSY    (BIT(2))
#define I3C_MST_BUS_BUSY_M  (I3C_MST_BUS_BUSY_V << I3C_MST_BUS_BUSY_S)
#define I3C_MST_BUS_BUSY_V  0x00000001U
#define I3C_MST_BUS_BUSY_S  2
/** I3C_MST_BUS_FREE : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define I3C_MST_BUS_FREE    (BIT(3))
#define I3C_MST_BUS_FREE_M  (I3C_MST_BUS_FREE_V << I3C_MST_BUS_FREE_S)
#define I3C_MST_BUS_FREE_V  0x00000001U
#define I3C_MST_BUS_FREE_S  3
/** I3C_MST_CMD_TID : RO; bitpos: [12:9]; default: 0;
 *  NA
 */
#define I3C_MST_CMD_TID    0x0000000FU
#define I3C_MST_CMD_TID_M  (I3C_MST_CMD_TID_V << I3C_MST_CMD_TID_S)
#define I3C_MST_CMD_TID_V  0x0000000FU
#define I3C_MST_CMD_TID_S  9
/** I3C_MST_SCL_GEN_FSM_STATE : RO; bitpos: [15:13]; default: 0;
 *  NA
 */
#define I3C_MST_SCL_GEN_FSM_STATE    0x00000007U
#define I3C_MST_SCL_GEN_FSM_STATE_M  (I3C_MST_SCL_GEN_FSM_STATE_V << I3C_MST_SCL_GEN_FSM_STATE_S)
#define I3C_MST_SCL_GEN_FSM_STATE_V  0x00000007U
#define I3C_MST_SCL_GEN_FSM_STATE_S  13
/** I3C_MST_IBI_EV_HANDLE_FSM_STATE : RO; bitpos: [18:16]; default: 0;
 *  NA
 */
#define I3C_MST_IBI_EV_HANDLE_FSM_STATE    0x00000007U
#define I3C_MST_IBI_EV_HANDLE_FSM_STATE_M  (I3C_MST_IBI_EV_HANDLE_FSM_STATE_V << I3C_MST_IBI_EV_HANDLE_FSM_STATE_S)
#define I3C_MST_IBI_EV_HANDLE_FSM_STATE_V  0x00000007U
#define I3C_MST_IBI_EV_HANDLE_FSM_STATE_S  16
/** I3C_MST_I2C_MODE_FSM_STATE : RO; bitpos: [21:19]; default: 0;
 *  NA
 */
#define I3C_MST_I2C_MODE_FSM_STATE    0x00000007U
#define I3C_MST_I2C_MODE_FSM_STATE_M  (I3C_MST_I2C_MODE_FSM_STATE_V << I3C_MST_I2C_MODE_FSM_STATE_S)
#define I3C_MST_I2C_MODE_FSM_STATE_V  0x00000007U
#define I3C_MST_I2C_MODE_FSM_STATE_S  19
/** I3C_MST_SDR_MODE_FSM_STATE : RO; bitpos: [25:22]; default: 0;
 *  NA
 */
#define I3C_MST_SDR_MODE_FSM_STATE    0x0000000FU
#define I3C_MST_SDR_MODE_FSM_STATE_M  (I3C_MST_SDR_MODE_FSM_STATE_V << I3C_MST_SDR_MODE_FSM_STATE_S)
#define I3C_MST_SDR_MODE_FSM_STATE_V  0x0000000FU
#define I3C_MST_SDR_MODE_FSM_STATE_S  22
/** I3C_MST_DAA_MODE_FSM_STATE : RO; bitpos: [28:26]; default: 0;
 *  Reflects whether the Master Controller is in IDLE or not. This bit will be set when
 *  all the buffer(Command, Response, IBI, Transmit, Receive) are empty along with the
 *  Master State machine is in idle state. 0X0: not in idle  0x1: in idle
 */
#define I3C_MST_DAA_MODE_FSM_STATE    0x00000007U
#define I3C_MST_DAA_MODE_FSM_STATE_M  (I3C_MST_DAA_MODE_FSM_STATE_V << I3C_MST_DAA_MODE_FSM_STATE_S)
#define I3C_MST_DAA_MODE_FSM_STATE_V  0x00000007U
#define I3C_MST_DAA_MODE_FSM_STATE_S  26
/** I3C_MST_MAIN_FSM_STATE : RO; bitpos: [31:29]; default: 0;
 *  NA
 */
#define I3C_MST_MAIN_FSM_STATE    0x00000007U
#define I3C_MST_MAIN_FSM_STATE_M  (I3C_MST_MAIN_FSM_STATE_V << I3C_MST_MAIN_FSM_STATE_S)
#define I3C_MST_MAIN_FSM_STATE_V  0x00000007U
#define I3C_MST_MAIN_FSM_STATE_S  29

/** I3C_MST_PRESENT_STATE1_REG register
 *  NA
 */
#define I3C_MST_PRESENT_STATE1_REG (DR_REG_I3C_MST_BASE + 0x54)
/** I3C_MST_DATA_BYTE_CNT : RO; bitpos: [15:0]; default: 0;
 *  Present transfer data byte cnt: tx data byte cnt if write  rx data byte cnt if read
 *  ibi data byte cnt if IBI handle.
 */
#define I3C_MST_DATA_BYTE_CNT    0x0000FFFFU
#define I3C_MST_DATA_BYTE_CNT_M  (I3C_MST_DATA_BYTE_CNT_V << I3C_MST_DATA_BYTE_CNT_S)
#define I3C_MST_DATA_BYTE_CNT_V  0x0000FFFFU
#define I3C_MST_DATA_BYTE_CNT_S  0

/** I3C_MST_DEVICE_TABLE_REG register
 *  Pointer for Device Address Table
 */
#define I3C_MST_DEVICE_TABLE_REG (DR_REG_I3C_MST_BASE + 0x58)
/** I3C_MST_REG_DCT_DAA_INIT_INDEX : R/W; bitpos: [3:0]; default: 0;
 *  Reserved
 */
#define I3C_MST_REG_DCT_DAA_INIT_INDEX    0x0000000FU
#define I3C_MST_REG_DCT_DAA_INIT_INDEX_M  (I3C_MST_REG_DCT_DAA_INIT_INDEX_V << I3C_MST_REG_DCT_DAA_INIT_INDEX_S)
#define I3C_MST_REG_DCT_DAA_INIT_INDEX_V  0x0000000FU
#define I3C_MST_REG_DCT_DAA_INIT_INDEX_S  0
/** I3C_MST_REG_DAT_DAA_INIT_INDEX : R/W; bitpos: [7:4]; default: 0;
 *  NA
 */
#define I3C_MST_REG_DAT_DAA_INIT_INDEX    0x0000000FU
#define I3C_MST_REG_DAT_DAA_INIT_INDEX_M  (I3C_MST_REG_DAT_DAA_INIT_INDEX_V << I3C_MST_REG_DAT_DAA_INIT_INDEX_S)
#define I3C_MST_REG_DAT_DAA_INIT_INDEX_V  0x0000000FU
#define I3C_MST_REG_DAT_DAA_INIT_INDEX_S  4
/** I3C_MST_PRESENT_DCT_INDEX : RO; bitpos: [11:8]; default: 0;
 *  NA
 */
#define I3C_MST_PRESENT_DCT_INDEX    0x0000000FU
#define I3C_MST_PRESENT_DCT_INDEX_M  (I3C_MST_PRESENT_DCT_INDEX_V << I3C_MST_PRESENT_DCT_INDEX_S)
#define I3C_MST_PRESENT_DCT_INDEX_V  0x0000000FU
#define I3C_MST_PRESENT_DCT_INDEX_S  8
/** I3C_MST_PRESENT_DAT_INDEX : RO; bitpos: [15:12]; default: 0;
 *  NA
 */
#define I3C_MST_PRESENT_DAT_INDEX    0x0000000FU
#define I3C_MST_PRESENT_DAT_INDEX_M  (I3C_MST_PRESENT_DAT_INDEX_V << I3C_MST_PRESENT_DAT_INDEX_S)
#define I3C_MST_PRESENT_DAT_INDEX_V  0x0000000FU
#define I3C_MST_PRESENT_DAT_INDEX_S  12

/** I3C_MST_TIME_OUT_VALUE_REG register
 *  NA
 */
#define I3C_MST_TIME_OUT_VALUE_REG (DR_REG_I3C_MST_BASE + 0x5c)
/** I3C_MST_REG_RESP_BUF_TO_VALUE : R/W; bitpos: [4:0]; default: 16;
 *  NA
 */
#define I3C_MST_REG_RESP_BUF_TO_VALUE    0x0000001FU
#define I3C_MST_REG_RESP_BUF_TO_VALUE_M  (I3C_MST_REG_RESP_BUF_TO_VALUE_V << I3C_MST_REG_RESP_BUF_TO_VALUE_S)
#define I3C_MST_REG_RESP_BUF_TO_VALUE_V  0x0000001FU
#define I3C_MST_REG_RESP_BUF_TO_VALUE_S  0
/** I3C_MST_REG_RESP_BUF_TO_EN : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RESP_BUF_TO_EN    (BIT(5))
#define I3C_MST_REG_RESP_BUF_TO_EN_M  (I3C_MST_REG_RESP_BUF_TO_EN_V << I3C_MST_REG_RESP_BUF_TO_EN_S)
#define I3C_MST_REG_RESP_BUF_TO_EN_V  0x00000001U
#define I3C_MST_REG_RESP_BUF_TO_EN_S  5
/** I3C_MST_REG_IBI_DATA_BUF_TO_VALUE : R/W; bitpos: [10:6]; default: 16;
 *  NA
 */
#define I3C_MST_REG_IBI_DATA_BUF_TO_VALUE    0x0000001FU
#define I3C_MST_REG_IBI_DATA_BUF_TO_VALUE_M  (I3C_MST_REG_IBI_DATA_BUF_TO_VALUE_V << I3C_MST_REG_IBI_DATA_BUF_TO_VALUE_S)
#define I3C_MST_REG_IBI_DATA_BUF_TO_VALUE_V  0x0000001FU
#define I3C_MST_REG_IBI_DATA_BUF_TO_VALUE_S  6
/** I3C_MST_REG_IBI_DATA_BUF_TO_EN : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define I3C_MST_REG_IBI_DATA_BUF_TO_EN    (BIT(11))
#define I3C_MST_REG_IBI_DATA_BUF_TO_EN_M  (I3C_MST_REG_IBI_DATA_BUF_TO_EN_V << I3C_MST_REG_IBI_DATA_BUF_TO_EN_S)
#define I3C_MST_REG_IBI_DATA_BUF_TO_EN_V  0x00000001U
#define I3C_MST_REG_IBI_DATA_BUF_TO_EN_S  11
/** I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE : R/W; bitpos: [16:12]; default: 16;
 *  NA
 */
#define I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE    0x0000001FU
#define I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE_M  (I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE_V << I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE_S)
#define I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE_V  0x0000001FU
#define I3C_MST_REG_IBI_STATUS_BUF_TO_VALUE_S  12
/** I3C_MST_REG_IBI_STATUS_BUF_TO_EN : R/W; bitpos: [17]; default: 0;
 *  NA
 */
#define I3C_MST_REG_IBI_STATUS_BUF_TO_EN    (BIT(17))
#define I3C_MST_REG_IBI_STATUS_BUF_TO_EN_M  (I3C_MST_REG_IBI_STATUS_BUF_TO_EN_V << I3C_MST_REG_IBI_STATUS_BUF_TO_EN_S)
#define I3C_MST_REG_IBI_STATUS_BUF_TO_EN_V  0x00000001U
#define I3C_MST_REG_IBI_STATUS_BUF_TO_EN_S  17
/** I3C_MST_REG_RX_DATA_BUF_TO_VALUE : R/W; bitpos: [22:18]; default: 16;
 *  NA
 */
#define I3C_MST_REG_RX_DATA_BUF_TO_VALUE    0x0000001FU
#define I3C_MST_REG_RX_DATA_BUF_TO_VALUE_M  (I3C_MST_REG_RX_DATA_BUF_TO_VALUE_V << I3C_MST_REG_RX_DATA_BUF_TO_VALUE_S)
#define I3C_MST_REG_RX_DATA_BUF_TO_VALUE_V  0x0000001FU
#define I3C_MST_REG_RX_DATA_BUF_TO_VALUE_S  18
/** I3C_MST_REG_RX_DATA_BUF_TO_EN : R/W; bitpos: [23]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RX_DATA_BUF_TO_EN    (BIT(23))
#define I3C_MST_REG_RX_DATA_BUF_TO_EN_M  (I3C_MST_REG_RX_DATA_BUF_TO_EN_V << I3C_MST_REG_RX_DATA_BUF_TO_EN_S)
#define I3C_MST_REG_RX_DATA_BUF_TO_EN_V  0x00000001U
#define I3C_MST_REG_RX_DATA_BUF_TO_EN_S  23

/** I3C_MST_SCL_I3C_MST_OD_TIME_REG register
 *  NA
 */
#define I3C_MST_SCL_I3C_MST_OD_TIME_REG (DR_REG_I3C_MST_BASE + 0x60)
/** I3C_MST_REG_I3C_MST_OD_LOW_PERIOD : R/W; bitpos: [15:0]; default: 25;
 *  SCL Open-Drain low count for I3C transfers targeted to I3C devices.
 */
#define I3C_MST_REG_I3C_MST_OD_LOW_PERIOD    0x0000FFFFU
#define I3C_MST_REG_I3C_MST_OD_LOW_PERIOD_M  (I3C_MST_REG_I3C_MST_OD_LOW_PERIOD_V << I3C_MST_REG_I3C_MST_OD_LOW_PERIOD_S)
#define I3C_MST_REG_I3C_MST_OD_LOW_PERIOD_V  0x0000FFFFU
#define I3C_MST_REG_I3C_MST_OD_LOW_PERIOD_S  0
/** I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD : R/W; bitpos: [31:16]; default: 5;
 *  SCL Open-Drain High count for I3C transfers targeted to I3C devices.
 */
#define I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD    0x0000FFFFU
#define I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD_M  (I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD_V << I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD_S)
#define I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD_V  0x0000FFFFU
#define I3C_MST_REG_I3C_MST_OD_HIGH_PERIOD_S  16

/** I3C_MST_SCL_I3C_MST_PP_TIME_REG register
 *  NA
 */
#define I3C_MST_SCL_I3C_MST_PP_TIME_REG (DR_REG_I3C_MST_BASE + 0x64)
/** I3C_MST_REG_I3C_MST_PP_LOW_PERIOD : R/W; bitpos: [7:0]; default: 5;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_PP_LOW_PERIOD    0x000000FFU
#define I3C_MST_REG_I3C_MST_PP_LOW_PERIOD_M  (I3C_MST_REG_I3C_MST_PP_LOW_PERIOD_V << I3C_MST_REG_I3C_MST_PP_LOW_PERIOD_S)
#define I3C_MST_REG_I3C_MST_PP_LOW_PERIOD_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_PP_LOW_PERIOD_S  0
/** I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD : R/W; bitpos: [23:16]; default: 5;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD    0x000000FFU
#define I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD_M  (I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD_V << I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD_S)
#define I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_PP_HIGH_PERIOD_S  16

