espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_reg.h
/** I3C_MST_SCL_I2C_FM_TIME_REG register
 *  NA
 */
#define I3C_MST_SCL_I2C_FM_TIME_REG (DR_REG_I3C_MST_BASE + 0x68)
/** I3C_MST_REG_I2C_FM_LOW_PERIOD : R/W; bitpos: [15:0]; default: 163;
 *  NA
 */
#define I3C_MST_REG_I2C_FM_LOW_PERIOD    0x0000FFFFU
#define I3C_MST_REG_I2C_FM_LOW_PERIOD_M  (I3C_MST_REG_I2C_FM_LOW_PERIOD_V << I3C_MST_REG_I2C_FM_LOW_PERIOD_S)
#define I3C_MST_REG_I2C_FM_LOW_PERIOD_V  0x0000FFFFU
#define I3C_MST_REG_I2C_FM_LOW_PERIOD_S  0
/** I3C_MST_REG_I2C_FM_HIGH_PERIOD : R/W; bitpos: [31:16]; default: 75;
 *  The SCL open-drain low count timing for I2C Fast Mode transfers.
 */
#define I3C_MST_REG_I2C_FM_HIGH_PERIOD    0x0000FFFFU
#define I3C_MST_REG_I2C_FM_HIGH_PERIOD_M  (I3C_MST_REG_I2C_FM_HIGH_PERIOD_V << I3C_MST_REG_I2C_FM_HIGH_PERIOD_S)
#define I3C_MST_REG_I2C_FM_HIGH_PERIOD_V  0x0000FFFFU
#define I3C_MST_REG_I2C_FM_HIGH_PERIOD_S  16

/** I3C_MST_SCL_I2C_FMP_TIME_REG register
 *  NA
 */
#define I3C_MST_SCL_I2C_FMP_TIME_REG (DR_REG_I3C_MST_BASE + 0x6c)
/** I3C_MST_REG_I2C_FMP_LOW_PERIOD : R/W; bitpos: [15:0]; default: 63;
 *  NA
 */
#define I3C_MST_REG_I2C_FMP_LOW_PERIOD    0x0000FFFFU
#define I3C_MST_REG_I2C_FMP_LOW_PERIOD_M  (I3C_MST_REG_I2C_FMP_LOW_PERIOD_V << I3C_MST_REG_I2C_FMP_LOW_PERIOD_S)
#define I3C_MST_REG_I2C_FMP_LOW_PERIOD_V  0x0000FFFFU
#define I3C_MST_REG_I2C_FMP_LOW_PERIOD_S  0
/** I3C_MST_REG_I2C_FMP_HIGH_PERIOD : R/W; bitpos: [23:16]; default: 33;
 *  NA
 */
#define I3C_MST_REG_I2C_FMP_HIGH_PERIOD    0x000000FFU
#define I3C_MST_REG_I2C_FMP_HIGH_PERIOD_M  (I3C_MST_REG_I2C_FMP_HIGH_PERIOD_V << I3C_MST_REG_I2C_FMP_HIGH_PERIOD_S)
#define I3C_MST_REG_I2C_FMP_HIGH_PERIOD_V  0x000000FFU
#define I3C_MST_REG_I2C_FMP_HIGH_PERIOD_S  16

/** I3C_MST_SCL_EXT_LOW_TIME_REG register
 *  NA
 */
#define I3C_MST_SCL_EXT_LOW_TIME_REG (DR_REG_I3C_MST_BASE + 0x70)
/** I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1 : R/W; bitpos: [7:0]; default: 0;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1    0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1_M  (I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1_V << I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1_S)
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD1_S  0
/** I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2 : R/W; bitpos: [15:8]; default: 0;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2    0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2_M  (I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2_V << I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2_S)
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD2_S  8
/** I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3 : R/W; bitpos: [23:16]; default: 0;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3    0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3_M  (I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3_V << I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3_S)
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD3_S  16
/** I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4 : R/W; bitpos: [31:24]; default: 0;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4    0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4_M  (I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4_V << I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4_S)
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_EXT_LOW_PERIOD4_S  24

/** I3C_MST_SDA_SAMPLE_TIME_REG register
 *  NA
 */
#define I3C_MST_SDA_SAMPLE_TIME_REG (DR_REG_I3C_MST_BASE + 0x74)
/** I3C_MST_REG_SDA_OD_SAMPLE_TIME : R/W; bitpos: [8:0]; default: 0;
 *  It is used to adjust sda sample point when scl high under open drain speed
 */
#define I3C_MST_REG_SDA_OD_SAMPLE_TIME    0x000001FFU
#define I3C_MST_REG_SDA_OD_SAMPLE_TIME_M  (I3C_MST_REG_SDA_OD_SAMPLE_TIME_V << I3C_MST_REG_SDA_OD_SAMPLE_TIME_S)
#define I3C_MST_REG_SDA_OD_SAMPLE_TIME_V  0x000001FFU
#define I3C_MST_REG_SDA_OD_SAMPLE_TIME_S  0
/** I3C_MST_REG_SDA_PP_SAMPLE_TIME : R/W; bitpos: [13:9]; default: 0;
 *  It is used to adjust sda sample point when scl high under push pull speed
 */
#define I3C_MST_REG_SDA_PP_SAMPLE_TIME    0x0000001FU
#define I3C_MST_REG_SDA_PP_SAMPLE_TIME_M  (I3C_MST_REG_SDA_PP_SAMPLE_TIME_V << I3C_MST_REG_SDA_PP_SAMPLE_TIME_S)
#define I3C_MST_REG_SDA_PP_SAMPLE_TIME_V  0x0000001FU
#define I3C_MST_REG_SDA_PP_SAMPLE_TIME_S  9

/** I3C_MST_SDA_HOLD_TIME_REG register
 *  NA
 */
#define I3C_MST_SDA_HOLD_TIME_REG (DR_REG_I3C_MST_BASE + 0x78)
/** I3C_MST_REG_SDA_OD_TX_HOLD_TIME : R/W; bitpos: [8:0]; default: 1;
 *  It is used to adjust sda drive point after scl neg under open drain speed
 */
#define I3C_MST_REG_SDA_OD_TX_HOLD_TIME    0x000001FFU
#define I3C_MST_REG_SDA_OD_TX_HOLD_TIME_M  (I3C_MST_REG_SDA_OD_TX_HOLD_TIME_V << I3C_MST_REG_SDA_OD_TX_HOLD_TIME_S)
#define I3C_MST_REG_SDA_OD_TX_HOLD_TIME_V  0x000001FFU
#define I3C_MST_REG_SDA_OD_TX_HOLD_TIME_S  0
/** I3C_MST_REG_SDA_PP_TX_HOLD_TIME : R/W; bitpos: [13:9]; default: 0;
 *  It is used to adjust sda dirve point after scl neg under push pull speed
 */
#define I3C_MST_REG_SDA_PP_TX_HOLD_TIME    0x0000001FU
#define I3C_MST_REG_SDA_PP_TX_HOLD_TIME_M  (I3C_MST_REG_SDA_PP_TX_HOLD_TIME_V << I3C_MST_REG_SDA_PP_TX_HOLD_TIME_S)
#define I3C_MST_REG_SDA_PP_TX_HOLD_TIME_V  0x0000001FU
#define I3C_MST_REG_SDA_PP_TX_HOLD_TIME_S  9

/** I3C_MST_SCL_START_HOLD_REG register
 *  NA
 */
#define I3C_MST_SCL_START_HOLD_REG (DR_REG_I3C_MST_BASE + 0x7c)
/** I3C_MST_REG_SCL_START_HOLD_TIME : R/W; bitpos: [8:0]; default: 8;
 *  I2C_SCL_START_HOLD_TIME
 */
#define I3C_MST_REG_SCL_START_HOLD_TIME    0x000001FFU
#define I3C_MST_REG_SCL_START_HOLD_TIME_M  (I3C_MST_REG_SCL_START_HOLD_TIME_V << I3C_MST_REG_SCL_START_HOLD_TIME_S)
#define I3C_MST_REG_SCL_START_HOLD_TIME_V  0x000001FFU
#define I3C_MST_REG_SCL_START_HOLD_TIME_S  0
/** I3C_MST_REG_START_DET_HOLD_TIME : R/W; bitpos: [10:9]; default: 0;
 *  NA
 */
#define I3C_MST_REG_START_DET_HOLD_TIME    0x00000003U
#define I3C_MST_REG_START_DET_HOLD_TIME_M  (I3C_MST_REG_START_DET_HOLD_TIME_V << I3C_MST_REG_START_DET_HOLD_TIME_S)
#define I3C_MST_REG_START_DET_HOLD_TIME_V  0x00000003U
#define I3C_MST_REG_START_DET_HOLD_TIME_S  9

/** I3C_MST_SCL_RSTART_SETUP_REG register
 *  NA
 */
#define I3C_MST_SCL_RSTART_SETUP_REG (DR_REG_I3C_MST_BASE + 0x80)
/** I3C_MST_REG_SCL_RSTART_SETUP_TIME : R/W; bitpos: [8:0]; default: 8;
 *  I2C_SCL_RSTART_SETUP_TIME
 */
#define I3C_MST_REG_SCL_RSTART_SETUP_TIME    0x000001FFU
#define I3C_MST_REG_SCL_RSTART_SETUP_TIME_M  (I3C_MST_REG_SCL_RSTART_SETUP_TIME_V << I3C_MST_REG_SCL_RSTART_SETUP_TIME_S)
#define I3C_MST_REG_SCL_RSTART_SETUP_TIME_V  0x000001FFU
#define I3C_MST_REG_SCL_RSTART_SETUP_TIME_S  0

/** I3C_MST_SCL_STOP_HOLD_REG register
 *  NA
 */
#define I3C_MST_SCL_STOP_HOLD_REG (DR_REG_I3C_MST_BASE + 0x84)
/** I3C_MST_REG_SCL_STOP_HOLD_TIME : R/W; bitpos: [8:0]; default: 8;
 *  I2C_SCL_STOP_HOLD_TIME
 */
#define I3C_MST_REG_SCL_STOP_HOLD_TIME    0x000001FFU
#define I3C_MST_REG_SCL_STOP_HOLD_TIME_M  (I3C_MST_REG_SCL_STOP_HOLD_TIME_V << I3C_MST_REG_SCL_STOP_HOLD_TIME_S)
#define I3C_MST_REG_SCL_STOP_HOLD_TIME_V  0x000001FFU
#define I3C_MST_REG_SCL_STOP_HOLD_TIME_S  0

