espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_reg.h
/** I3C_MST_SCL_STOP_SETUP_REG register
 *  NA
 */
#define I3C_MST_SCL_STOP_SETUP_REG (DR_REG_I3C_MST_BASE + 0x88)
/** I3C_MST_REG_SCL_STOP_SETUP_TIME : R/W; bitpos: [8:0]; default: 8;
 *  I2C_SCL_STOP_SETUP_TIME
 */
#define I3C_MST_REG_SCL_STOP_SETUP_TIME    0x000001FFU
#define I3C_MST_REG_SCL_STOP_SETUP_TIME_M  (I3C_MST_REG_SCL_STOP_SETUP_TIME_V << I3C_MST_REG_SCL_STOP_SETUP_TIME_S)
#define I3C_MST_REG_SCL_STOP_SETUP_TIME_V  0x000001FFU
#define I3C_MST_REG_SCL_STOP_SETUP_TIME_S  0

/** I3C_MST_BUS_FREE_TIME_REG register
 *  NA
 */
#define I3C_MST_BUS_FREE_TIME_REG (DR_REG_I3C_MST_BASE + 0x90)
/** I3C_MST_REG_BUS_FREE_TIME : R/W; bitpos: [15:0]; default: 5;
 *  I3C Bus Free Count Value. This field is used only in Master mode. In pure Bus
 *  System, this field represents tCAS.  In Mixed Bus System, this field is expected to
 *  be programmed to tLOW of I2C Timing.
 */
#define I3C_MST_REG_BUS_FREE_TIME    0x0000FFFFU
#define I3C_MST_REG_BUS_FREE_TIME_M  (I3C_MST_REG_BUS_FREE_TIME_V << I3C_MST_REG_BUS_FREE_TIME_S)
#define I3C_MST_REG_BUS_FREE_TIME_V  0x0000FFFFU
#define I3C_MST_REG_BUS_FREE_TIME_S  0

/** I3C_MST_SCL_TERMN_T_EXT_LOW_TIME_REG register
 *  NA
 */
#define I3C_MST_SCL_TERMN_T_EXT_LOW_TIME_REG (DR_REG_I3C_MST_BASE + 0x94)
/** I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME : R/W; bitpos: [7:0]; default: 2;
 *  NA
 */
#define I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME    0x000000FFU
#define I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME_M  (I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME_V << I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME_S)
#define I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME_V  0x000000FFU
#define I3C_MST_REG_I3C_MST_TERMN_T_EXT_LOW_TIME_S  0

/** I3C_MST_VER_ID_REG register
 *  NA
 */
#define I3C_MST_VER_ID_REG (DR_REG_I3C_MST_BASE + 0xa0)
/** I3C_MST_REG_I3C_MST_VER_ID : R/W; bitpos: [31:0]; default: 539165956;
 *  This field indicates the controller current release number that is read by an
 *  application.
 */
#define I3C_MST_REG_I3C_MST_VER_ID    0xFFFFFFFFU
#define I3C_MST_REG_I3C_MST_VER_ID_M  (I3C_MST_REG_I3C_MST_VER_ID_V << I3C_MST_REG_I3C_MST_VER_ID_S)
#define I3C_MST_REG_I3C_MST_VER_ID_V  0xFFFFFFFFU
#define I3C_MST_REG_I3C_MST_VER_ID_S  0

/** I3C_MST_VER_TYPE_REG register
 *  NA
 */
#define I3C_MST_VER_TYPE_REG (DR_REG_I3C_MST_BASE + 0xa4)
/** I3C_MST_REG_I3C_MST_VER_TYPE : R/W; bitpos: [31:0]; default: 0;
 *  This field indicates the controller current release type that is read by an
 *  application.
 */
#define I3C_MST_REG_I3C_MST_VER_TYPE    0xFFFFFFFFU
#define I3C_MST_REG_I3C_MST_VER_TYPE_M  (I3C_MST_REG_I3C_MST_VER_TYPE_V << I3C_MST_REG_I3C_MST_VER_TYPE_S)
#define I3C_MST_REG_I3C_MST_VER_TYPE_V  0xFFFFFFFFU
#define I3C_MST_REG_I3C_MST_VER_TYPE_S  0

/** I3C_MST_FPGA_DEBUG_PROBE_REG register
 *  NA
 */
#define I3C_MST_FPGA_DEBUG_PROBE_REG (DR_REG_I3C_MST_BASE + 0xac)
/** I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE : R/W; bitpos: [31:0]; default: 1;
 *  For Debug Probe Test on FPGA
 */
#define I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE    0xFFFFFFFFU
#define I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE_M  (I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE_V << I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE_S)
#define I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE_V  0xFFFFFFFFU
#define I3C_MST_REG_I3C_MST_FPGA_DEBUG_PROBE_S  0

/** I3C_MST_RND_ECO_CS_REG register
 *  NA
 */
#define I3C_MST_RND_ECO_CS_REG (DR_REG_I3C_MST_BASE + 0xb0)
/** I3C_MST_REG_RND_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RND_ECO_EN    (BIT(0))
#define I3C_MST_REG_RND_ECO_EN_M  (I3C_MST_REG_RND_ECO_EN_V << I3C_MST_REG_RND_ECO_EN_S)
#define I3C_MST_REG_RND_ECO_EN_V  0x00000001U
#define I3C_MST_REG_RND_ECO_EN_S  0
/** I3C_MST_RND_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define I3C_MST_RND_ECO_RESULT    (BIT(1))
#define I3C_MST_RND_ECO_RESULT_M  (I3C_MST_RND_ECO_RESULT_V << I3C_MST_RND_ECO_RESULT_S)
#define I3C_MST_RND_ECO_RESULT_V  0x00000001U
#define I3C_MST_RND_ECO_RESULT_S  1

/** I3C_MST_RND_ECO_LOW_REG register
 *  NA
 */
#define I3C_MST_RND_ECO_LOW_REG (DR_REG_I3C_MST_BASE + 0xb4)
/** I3C_MST_REG_RND_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_REG_RND_ECO_LOW    0xFFFFFFFFU
#define I3C_MST_REG_RND_ECO_LOW_M  (I3C_MST_REG_RND_ECO_LOW_V << I3C_MST_REG_RND_ECO_LOW_S)
#define I3C_MST_REG_RND_ECO_LOW_V  0xFFFFFFFFU
#define I3C_MST_REG_RND_ECO_LOW_S  0

/** I3C_MST_RND_ECO_HIGH_REG register
 *  NA
 */
#define I3C_MST_RND_ECO_HIGH_REG (DR_REG_I3C_MST_BASE + 0xb8)
/** I3C_MST_REG_RND_ECO_HIGH : R/W; bitpos: [31:0]; default: 65535;
 *  NA
 */
#define I3C_MST_REG_RND_ECO_HIGH    0xFFFFFFFFU
#define I3C_MST_REG_RND_ECO_HIGH_M  (I3C_MST_REG_RND_ECO_HIGH_V << I3C_MST_REG_RND_ECO_HIGH_S)
#define I3C_MST_REG_RND_ECO_HIGH_V  0xFFFFFFFFU
#define I3C_MST_REG_RND_ECO_HIGH_S  0

#ifdef __cplusplus
}
#endif
